soap-builder/src/test/resources/services/test11/operations/ADEC_MAST_Binding/doGetSummary.request.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:ADEC_MAST">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:doGetSummary soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <ra xsi:type="xsd:double">?</ra>
         <dec xsi:type="xsd:double">?</dec>
         <radius xsi:type="xsd:double">?</radius>
      </urn:doGetSummary>
   </soapenv:Body>
</soapenv:Envelope>